---
type: PartMaker
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# PartMaker

`Autodesk.Revit.DB.PartMaker` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetSourceElementIds | 2013 | `public ICollection < LinkElementId > GetSourceElementIds ()` |
| Method | IsSourceElement | 2013 | `public bool IsSourceElement ( ElementId elemId )` |
| Method | SetSourceElementIds | 2013 | `public void SetSourceElementIds ( ICollection < ElementId > sourceElementIds )` |
| Property | Parameter | — | `` |